to-do-app/test/artillery.yml
config:
  target: 'http://127.0.0.1:8080'
  phases:
    - duration: 60
      arrivalRate: 20
  defaults:
    headers:
     some-headers: 'some-value'
scenarios:
  - flow:
    - get:
        url: "/items"
    - post:
        url: "/items"
        json:
              description: "Milk"
              checked: false
    - get:
            url: "/items/1"
    - delete:
            url: "/items/1"